
Questions 1:
How to import pandas and check the version?

In [1]:

import numpy as np
import pandas as pd
import seaborn as sns

In [2]:
print(pd.__version__)

1.0.1


Questions 2:
How to create a series from a numpy array?

In [3]:

data = pd.Series(np.array([1,2,3]))
data

0    1
1    2
2    3
dtype: int32

Questions 3:
How to convert the index of a series into a column of a dataframe?

In [6]:
#pd.DataFrame(data,columns=['Value'])
dictionary = {'Name:':['a', 'b', 'c'], 'Marks': [40, 88, 85], 'Grade' : ['C','A','A']}
df = pd.DataFrame(dictionary)
df

  Name:  Marks Grade
0     a     40     C
1     b     88     A
2     c     85     A

In [7]:
# creating a index column in dataframe
df.reset_index(level=0, inplace=True) 
df

   index Name:  Marks Grade
0      0     a     40     C
1      1     b     88     A
2      2     c     85     A

Questions 4:
Write the code to list all the datasets available in seaborn library. Load the 'mpg' dataset Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the materials folder)

In [9]:
print(sns.get_dataset_names())

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [10]:

data = sns.load_dataset("mpg")
data.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

Questions 5:
Which country origin cars are a part of this dataset?

In [12]:
data['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64


Questions 6:
Extract the part of the dataframe which contains cars belonging to 'usa'

In [14]:

print(pd.DataFrame(data[data['origin']=='usa']))

      mpg  cylinders  displacement  horsepower  weight  acceleration  \
0    18.0          8         307.0       130.0    3504          12.0
1    15.0          8         350.0       165.0    3693          11.5
2    18.0          8         318.0       150.0    3436          11.0
3    16.0          8         304.0       150.0    3433          12.0
4    17.0          8         302.0       140.0    3449          10.5
..    ...        ...           ...         ...     ...           ...
392  27.0          4         151.0        90.0    2950          17.3
393  27.0          4         140.0        86.0    2790          15.6
395  32.0          4         135.0        84.0    2295          11.6
396  28.0          4         120.0        79.0    2625          18.6
397  31.0          4         119.0        82.0    2720          19.4

     model_year origin                       name
0            70    usa  chevrolet chevelle malibu
1            70    usa          buick skylark 320
2            70    usa         plymouth satellite
3            70    usa              amc rebel sst
4            70    usa                ford torino
..          ...    ...                        ...
392          82    usa           chevrolet camaro
393          82    usa            ford mustang gl
395          82    usa              dodge rampage
396          82    usa                ford ranger
397          82    usa                 chevy s-10

[249 rows x 9 columns]